Update to mermaid diagrams.
